back_api/api/actions/FaqAction.php

    public static function getList(){
           return Faq::find()
               ->where(['status' => '1'])
               ->all();
---
SELECT * FROM `faq` WHERE `status`='1'