back_api/api/actions/NewsAction.php

    public static function getImages($id)
    {
        $images = Image::find()->where(['itemId'=>$id, 'modelName'=>'News'])->all();
---
SELECT * FROM `image` WHERE (`itemId`='27') AND (`modelName`='News')